Documents/ОтправкаAWB.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОтправкаAWB</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Затраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AWB</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Перевозчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инвойсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инвойс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПодбораНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВКД_ОприходованиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВКД_ОприходованиеНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЦенаСоСкидкой</Name>
					<Comment>(в долларах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупки</Name>
					<Comment>(в долларах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/СкорректированныеИнвойсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>СкорректированныеИнвойсы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиИнвойса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСтроки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСтрокИнвойса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СостоянияИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнвойсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИнспекции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплатыАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Долги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НазначениеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НазначениеФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОтправкаAWB/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;

	ОтобразитьТоварныеГруппы();

	ЗаполнитьКэшДанных();
	
	//лРаскраскаСтатусов =  ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьСтатусыВФормеСписка");
	//глПокраситьСтатусы(ЭтаФорма, "Инвойсы", лРаскраскаСтатусов, , );  
	
	СформироватьГиперссылкиФайловНаФорме();

	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
	Элементы.ВалютаЗатрат.БыстрыйВыбор = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют"); 
	
	СтруктураПечатныхФорм = Документы.ОтправкаAWB.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Истина, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   
	
	ЗаполнитьДеревоЗначенийНаСервере();

КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);

	ОтобразитьЦветВалюты();
	ОбновитьИтоги();
	УстановитьДоступность();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// !! Функционал с выбором поставки выбранного инвойса --
	//
	//НедопоставкиИнвойса = НедопоставкиИнвойса(ВыбранноеЗначение); 
	//Если НедопоставкиИнвойса.Количество() = 0 Тогда
	//    клВнимание(НСтр("ru = 'По выбранной поставке все товары уже доставлены!'; en = 'For the selected delivery, all goods have already been delivered!'"), , НСтр("ru = 'Выбор поставки'; en = 'Delivery selection'"));
	//	Возврат;
	//ИначеЕсли НедопоставкиИнвойса.Количество() = 1 Тогда	
	//    ВыбраннаяПоставка = НедопоставкиИнвойса[0].Значение;
	//Иначе
	//	ВыбраннаяПоставка = клВариантСписка(НСтр("ru = 'Выберите поставку'; en = 'Select delivery'"), НедопоставкиИнвойса); 
	//	Если ВыбраннаяПоставка = Неопределено Тогда
	//	    Возврат;
	//	КонецЕсли;
	//КонецЕсли;                                                    
	//
	//НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс", ВыбранноеЗначение)); 
	//Если НайдСтроки.Количество() > 0 Тогда
	//	Возврат;
	//КонецЕсли;        
	//НовСтрокаТЧ = Объект.Инвойсы.Добавить(); 
	//НовСтрокаТЧ.Инвойс 		= ВыбранноеЗначение; 
	//НовСтрокаТЧ.Поставка 	= ВыбраннаяПоставка;
	//ЗаполнитьДанныеСтрокиПоИнвойсу(НовСтрокаТЧ); 
	// 
	// -- !!
	
	Если ИсточникВыбора.ПоследнееОтправлено Тогда 
		//ИсточникВыбора.ТекущийЭлемент.ТекущиеДанные.НомерИнвойса
		клПредупреждение(НСтр("ru = 'Уже отправлено!'; en = 'Already sent!'"), 5, НСтр("ru = 'Выбор инвойса/поставки'; en = 'Selection the invoice/delivery'"));
		Возврат;
	КонецЕсли; 
	ВыбИнвойс 		= ИсточникВыбора.ПоследнийДокумент; 
	ВыбПоставка		= ИсточникВыбора.ПоследняяПоставка;

	//НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс", ВыбИнвойс)); 
	НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс,Поставка", ВыбИнвойс, ВыбПоставка)); 
	Если НайдСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;        
	НовСтрокаТЧ = Объект.Инвойсы.Добавить(); 
	НовСтрокаТЧ.Инвойс 		= ВыбИнвойс; 
	НовСтрокаТЧ.Поставка 	= ВыбПоставка;
	ЗаполнитьДанныеСтрокиПоИнвойсу(НовСтрокаТЧ);
		
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Количество = Объект.Инвойсы.Итог("Количество");

	// проверка дублей строк
	Ошибки = Новый Соответствие;
	Для каждого СтрокаТЧ Из Объект.Инвойсы Цикл
		НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс,Поставка", СтрокаТЧ.Инвойс, СтрокаТЧ.Поставка));
		Если НайдСтроки.ВГраница() > 0 Тогда  
			Стр = "";
			Для Инд = 0 По НайдСтроки.ВГраница() Цикл
				Стр = Стр + НайдСтроки[Инд].НомерСтроки + ", ";
			КонецЦикла;
			Ошибки.Вставить(СтрокаТЧ.Инвойс, Стр);
		КонецЕсли;	
	КонецЦикла;
	Если Ошибки.Количество() > 0 Тогда
		ТекстОшибки = НСтр("ru = 'Найдены дубли в строках: '; en = 'Duplicates found in the lines: '") + Символы.ПС;
		Для каждого Ош Из Ошибки Цикл
			ТекстОшибки = СтрШаблон(НСтр("ru = '%1 %2 - строки %3%4'; en = '%1 %2 - lines %3%4'"), ТекстОшибки, Ош.Ключ, Ош.Значение, Символы.ПС);
		КонецЦикла;
		ТекстОшибки = Лев(ТекстОшибки, СтрДлина(ТекстОшибки)-3);	
		Сообщить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	ЗаполнитьКэшДанных();
	ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыПодбора(Рез, Доп) Экспорт 
	//если ничего не выбрали, то в рез будет пусто...
	//Если НЕ Рез = Неопределено Тогда 
	//	Объект.ТабличнаяЧасть1.Добавить().Кво = Рез;
	//КонецЕсли;
КонецПроцедуры

#КонецОбласти 


#Область СобытияТЧ

&НаКлиенте
Процедура ИнвойсыПослеУдаления(Элемент)
	
	ЗаполнитьКэшДанных();

КонецПроцедуры 
	
&НаКлиенте
Процедура ИнвойсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ИнвойсыНомерИнвойсаПоставщика" Тогда                                        
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элемент.ТекущиеДанные.Инвойс); 
	КонецЕсли;   

КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПриАктивизацииЯчейки(Элемент)
		 
	Поле = Элемент.ТекущийЭлемент; 
	Если Поле.Имя = "ИнвойсыПоставка" Тогда
	
		Поле.СписокВыбора.Очистить();
		КвоПоставок = КэшДанных.Инвойсы[Элемент.ТекущиеДанные.Инвойс].КоличествоПоставокВИнвойсе;
		Если КвоПоставок = 0 Тогда
			//Поле.СписокВыбора.Добавить(0, "инвойс полностью");
		Иначе
			Для Инд = 1 По КвоПоставок Цикл   
				КвоВПоставке = КэшДанных.Инвойсы[Элемент.ТекущиеДанные.Инвойс].ПоставкиИнвойсов[Инд].Количество;
				Поле.СписокВыбора.Добавить(Инд, СтрШаблон(НСтр("ru = '%1 (из %2), кол-во %3'; en = '%1 (of %2), quantity %3'"), Инд, КвоПоставок, КвоВПоставке));
			КонецЦикла;
			//Элемент.ТекущиеДанные.Поставка = 1;
		КонецЕсли;	
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПоставкаПриИзменении(Элемент)
	
	УстановитьКоличествоПоставки(Элементы.Инвойсы.ТекущиеДанные); 

КонецПроцедуры     

&НаКлиенте
Процедура ИнвойсыИнвойсПриИзменении(Элемент)

	ЗаполнитьДанныеСтрокиПоИнвойсу(Элементы.Инвойсы.ТекущиеДанные);

КонецПроцедуры

#КонецОбласти   


#Область КомандыФормы

&НаКлиенте
Процедура Установить(Команда)
	
	Если Объект.Окончательно Тогда Возврат КонецЕсли;
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Инвойсы.Количество() = 0 Тогда 
		клНамекнуть(ИмяДокумента, НСтр("ru = 'Документ пуст!'; en = 'The document is empty!'"), БиблиотекаКартинок.ПоискДанных);
		Возврат;
	КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("УстановитьПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Установить флаг <Окончательно>? 
							|Документ будет проведен.'; en = 'Set flag <Finaly>?'"));
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Попытка
		Объект.Окончательно = Истина;
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));             
		УстановитьДоступность();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры	

&НаКлиенте
Процедура Снять(Команда)

	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли; 
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("СнятьПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Снять флаг <Окончательно>?'; en = 'Unset flag <Finaly>?'"));
	
КонецПроцедуры	

&НаКлиенте
Процедура СнятьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Ложь;
	Записать();
	УстановитьДоступность();

КонецПроцедуры	

&НаКлиенте
Процедура ВводНаОснованииИнвойса(Команда)
	
	Если Элементы.Инвойсы.ТекущиеДанные <> Неопределено Тогда                                                          
		ПараметрыФормы = Новый Структура("Основание", Новый Структура("Инвойс,Поставка", Элементы.Инвойсы.ТекущиеДанные.Инвойс, Элементы.Инвойсы.ТекущиеДанные.Поставка));
		ОткрытьФорму("Документ.ПриходнаяНакладная.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти


#Область Служебные

&НаКлиенте
Процедура ОтобразитьЦветВалюты()
	
	Если КэшДанных.РаскрашиватьВалюты Тогда
		Элементы.ВалютаЗатрат.ЦветФона = КэшДанных.ЦветаВалют.Получить(Объект.ВалютаЗатрат);
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	Для каждого Элемент Из Элементы Цикл 
		Тип = ТипЗнч(Элемент);
		Если Тип = Тип("ПолеФормы") ИЛИ Тип = Тип("ТаблицаФормы") Тогда
			Элемент.ТолькоПросмотр = Объект.Окончательно; 
		ИначеЕсли Тип = Тип("КнопкаФормы") И Элемент.Родитель <> Элементы.ФормаКоманднаяПанель И  Элемент.Родитель.Имя <> "МенюПечать" Тогда
			Элемент.Доступность = НЕ Объект.Окончательно;
		КонецЕсли;
	КонецЦикла;	    
	Если Элементы.Найти("Снять") <> Неопределено Тогда
		Элементы.Снять.Доступность = Объект.Окончательно;
	КонецЕсли;
	Если Элементы.Найти("Установить") <> Неопределено Тогда
		Элементы.Установить.Доступность = НЕ Объект.Окончательно;
	КонецЕсли;
	Элементы.Окончательно.ТолькоПросмотр = Истина;

КонецПроцедуры

#КонецОбласти 



#Область РаспределениеЗатрат

&НаСервереБезКонтекста
Функция ТоварнаяГруппа(Знач Номенклатура)
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Пока Номенклатура.Уровень() > 0 Цикл
			Группа = Номенклатура.Родитель.ГруппаПодбора;
			Если ЗначениеЗаполнено(Группа) Тогда
				Возврат Группа;
			КонецЕсли;
			Номенклатура = Номенклатура.Родитель;		
		КонецЦикла; 
	КонецЕсли;
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции   

&НаСервере
Процедура ОтобразитьТоварныеГруппы()
	
	 Для каждого СтрокаТЧ Из Объект.РаспределениеЗатрат Цикл 
		 СтрокаТЧ.ТоварнаяГруппа = ТоварнаяГруппа(СтрокаТЧ.Номенклатура);
	 КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗатраты(Команда)  
	
	//Если Объект.РаспределениеЗатрат.Количество() > 0 Тогда
	//  Если НЕ клДаНет("Табличная часть 'Распределение затрат' будет перезаполнена. Продолжить?") Тогда
	//    	Возврат;
	//   КонецЕсли;
	//КонецЕсли;      
	//
	//РаспределитьЗатратыНаСервере();  
	//Модифицированность = Истина;

	Если Объект.РаспределениеЗатрат.Количество() > 0 Тогда
		клДаНет(Новый ОписаниеОповещения("РаспределитьЗатратыЗавершение", ЭтотОбъект), "Табличная часть 'Распределение затрат' будет перезаполнена. Продолжить?");
		Возврат;
	КонецЕсли;

	РаспределитьЗатратыНаСервере();
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗатратыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	РаспределитьЗатратыНаСервере();
	Модифицированность = Истина; 
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьЗатратыНаСервере()
	
	Запр = Новый Запрос;  
	Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	ОприходНоменклатуры.Номенклатура КАК Номенклатура,
	             |	ЗНАЧЕНИЕ(Справочник.ГруппыПодбораНоменклатуры.ПустаяСсылка) КАК ТоварнаяГруппа,
	             |	СУММА(ОприходНоменклатуры.Количество) КАК Количество,
	             |	СУММА(ОприходНоменклатуры.Количество * ОприходНоменклатуры.Номенклатура.Вес) / 1000 КАК Вес
	             |ИЗ
	             |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры КАК ОприходНоменклатуры
	             |ГДЕ
	             |	(ОприходНоменклатуры.Документ, ОприходНоменклатуры.Поставка) В
	             |			(ВЫБРАТЬ
	             |				ИнвойсыОтправки.Инвойс,
	             |				ИнвойсыОтправки.Поставка
	             |			ИЗ
	             |				Документ.ОтправкаAWB.Инвойсы КАК ИнвойсыОтправки
	             |			ГДЕ
	             |				ИнвойсыОтправки.Ссылка = &Ссылка)
	             |	И ОприходНоменклатуры.Регистратор ССЫЛКА Документ._Инвойс
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ОприходНоменклатуры.Номенклатура
	             |АВТОУПОРЯДОЧИВАНИЕ" ;
	Выгрузка = Запр.Выполнить().Выгрузить();
	Для каждого СтрокаВыгрузки Из Выгрузка Цикл
		СтрокаВыгрузки.ТоварнаяГруппа = ТоварнаяГруппа(СтрокаВыгрузки.Номенклатура);
	КонецЦикла;
	
	тзРаспределениеЗатрат = Объект.РаспределениеЗатрат.Выгрузить();
	тзРаспределениеЗатрат.Очистить();
	тзЗатраты = Объект.Затраты.Выгрузить();
	тзЗатраты.Сортировать("ТоварнаяГруппа"); 	// чтобы сначала распределять общие
	
	// распределим по каждой затрате:
	Для каждого СтрокаЗатрат Из тзЗатраты Цикл
		
		Если ЗначениеЗаполнено(СтрокаЗатрат.ТоварнаяГруппа) Тогда
			СтрокиОднойГруппы = Выгрузка.НайтиСтроки(Новый Структура("ТоварнаяГруппа", СтрокаЗатрат.ТоварнаяГруппа));
		Иначе
			СтрокиОднойГруппы = Выгрузка;
		КонецЕсли;
		
		// распределим сумму затраты по весу
		ВесГруппы = 0;
		Для каждого СтрокаТЧ Из СтрокиОднойГруппы Цикл
			ВесГруппы = ВесГруппы + СтрокаТЧ.Вес;  
		КонецЦикла;
		   
		НайдСтроки = Объект.Затраты.НайтиСтроки(Новый Структура("Затрата,Сумма,ТоварнаяГруппа",
																СтрокаЗатрат.Затрата, СтрокаЗатрат.Сумма, СтрокаЗатрат.ТоварнаяГруппа));
		Если НайдСтроки.Количество() > 0 Тогда
			НайдСтрока = НайдСтроки[0];
			НайдСтрока.Вес = ВесГруппы; 
			//НайдСтрока.ЦенаКг = ?(НайдСтрока.Вес=0, НайдСтрока.Сумма, НайдСтрока.Сумма / НайдСтрока.Вес);
		КонецЕсли;
		
		к = ?(ВесГруппы=0, 0, СтрокаЗатрат.Сумма / ВесГруппы);
		Для каждого СтрокаГруппы Из СтрокиОднойГруппы Цикл
			//СтрокаТЧ.Сумма = СтрокаТЧ.Сумма + СтрокаТЧ.Вес * к; 
			СтрокаТЗ = тзРаспределениеЗатрат.Добавить();
			СтрокаТЗ.Номенклатура	= СтрокаГруппы.Номенклатура;
			СтрокаТЗ.Затрата        = СтрокаЗатрат.Затрата;
			СтрокаТЗ.Количество     = СтрокаГруппы.Количество;
			СтрокаТЗ.Вес            = СтрокаГруппы.Вес;
			СтрокаТЗ.Сумма          = СтрокаГруппы.Вес * к;
		КонецЦикла;
		
	КонецЦикла;	 
	
	тзРаспределениеЗатрат.Свернуть("Номенклатура,Затрата,Вес", "Количество,Сумма,Цена");
	Для каждого СтрокаТЗ Из тзРаспределениеЗатрат Цикл
		СтрокаТЗ.Цена = СтрокаТЗ.Сумма / СтрокаТЗ.Количество;
	КонецЦикла; 
	тзРаспределениеЗатрат.Сортировать("Номенклатура,Затрата");
	Объект.РаспределениеЗатрат.Загрузить(тзРаспределениеЗатрат);
	
	ЗаполнитьДеревоЗначенийНаСервере();
	ВОЗВРАТ;
	
	////////////////////////////////////

	лВыводитьСообщения = Ложь;
	
	Запр = Новый Запрос;  
	Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запр.Текст = "ВЫБРАТЬ
				|	ОприходНоменклатуры.Номенклатура,
				|	СУММА(ОприходНоменклатуры.Количество) КАК Количество,
				|	СУММА(ОприходНоменклатуры.Количество * ОприходНоменклатуры.Номенклатура.Вес) / 1000 КАК Вес
				|ИЗ
				|	РегистрНакопления.ВКД_ОприходованиеНоменклатуры КАК ОприходНоменклатуры
				|ГДЕ
				|	(ОприходНоменклатуры.Документ, ОприходНоменклатуры.Поставка) В
				|			(ВЫБРАТЬ
				|				ИнвойсыОтправки.Инвойс,
				|				ИнвойсыОтправки.Поставка
				|			ИЗ
				|				Документ.ОтправкаAWB.Инвойсы КАК ИнвойсыОтправки
				|			ГДЕ
				|				ИнвойсыОтправки.Ссылка = &Ссылка)
				|	И ОприходНоменклатуры.Регистратор ССЫЛКА Документ._Инвойс
				|
				|СГРУППИРОВАТЬ ПО
				|	ОприходНоменклатуры.Номенклатура
				|АВТОУПОРЯДОЧИВАНИЕ" ;
	Объект.РаспределениеЗатрат.Загрузить(Запр.Выполнить().Выгрузить()); 
	ОтобразитьТоварныеГруппы();

	Если Объект.РаспределениеЗатрат.Итог("Вес") = 0 Тогда
	 	Возврат;
	 КонецЕсли;
	 //К = Объект.СуммаЗатрат / Объект.РаспределениеЗатрат.Итог("Вес");
	 //Для каждого СтрокаТЧ Из Объект.РаспределениеЗатрат Цикл
	 //	СтрокаТЧ.Сумма 	= СтрокаТЧ.Вес * К;
	 //	СтрокаТЧ.Цена 	= СтрокаТЧ.Вес * К / СтрокаТЧ.Количество;
	 //КонецЦикла;
	 
	 тзЗатраты = Объект.Затраты.Выгрузить();
	 тзЗатраты.Сортировать("ТоварнаяГруппа"); 	// чтобы сначала распределять общие
	 
	 // распределим по каждой затрате:
	 Для каждого СтрокаЗатрат Из тзЗатраты Цикл
		 
		 Если лВыводитьСообщения Тогда
			Сообщить(СтрШаблон("Стр.%1. Распределение группы <%2> (сумма %3):", СтрокаЗатрат.НомерСтроки, СтрокаЗатрат.ТоварнаяГруппа, Формат(СтрокаЗатрат.Сумма,"ЧДЦ=2")));			 
		 КонецЕсли;   
		 
		 Если ЗначениеЗаполнено(СтрокаЗатрат.ТоварнаяГруппа) Тогда
			 СтрокиОднойГруппы = Объект.РаспределениеЗатрат.НайтиСтроки(Новый Структура("ТоварнаяГруппа", СтрокаЗатрат.ТоварнаяГруппа));
		 Иначе
			 СтрокиОднойГруппы = Объект.РаспределениеЗатрат;
		 КонецЕсли;
		 
		 // распределим сумму затраты по весу
		 ВесГруппы 	= 0;
		 Для каждого СтрокаТЧ Из СтрокиОднойГруппы Цикл
			 ВесГруппы 	= ВесГруппы + СтрокаТЧ.Вес;  
		 КонецЦикла;
			 //+  
			 НайдСтроки = Объект.Затраты.НайтиСтроки(Новый Структура("Затрата,Сумма,ТоварнаяГруппа",СтрокаЗатрат.Затрата,СтрокаЗатрат.Сумма,СтрокаЗатрат.ТоварнаяГруппа));
			 Если НайдСтроки.Количество() > 0 Тогда
				 НайдСтрока = НайдСтроки[0];
				 НайдСтрока.Вес = ВесГруппы; 
				 //НайдСтрока.ЦенаКг = ?(НайдСтрока.Вес=0, НайдСтрока.Сумма, НайдСтрока.Сумма / НайдСтрока.Вес);
			 КонецЕсли;
			 //-
		 к = ?(ВесГруппы=0, 0, СтрокаЗатрат.Сумма / ВесГруппы);
		 Для каждого СтрокаТЧ Из СтрокиОднойГруппы Цикл
			 СтрокаТЧ.Сумма = СтрокаТЧ.Сумма + СтрокаТЧ.Вес * к;
			 Если лВыводитьСообщения Тогда
				 Сообщить(СтрШаблон("   стр.%1 '%2': +%3", СтрокаТЧ.НомерСтроки, СтрокаТЧ.Номенклатура, Формат(СтрокаТЧ.Вес * к, "ЧДЦ=5")));			 
			 КонецЕсли;   
		 КонецЦикла;
		 
	 КонецЦикла;                               
	 
	 Для каждого СтрокаТЧ Из Объект.РаспределениеЗатрат Цикл
	 	СтрокаТЧ.Цена = СтрокаТЧ.Сумма / СтрокаТЧ.Количество;
	 КонецЦикла;
	 
	 Для каждого СтрокаТЧ Из Объект.Затраты Цикл
	 	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТоварнаяГруппа) Тогда
			СтрокаТЧ.Вес = 0;
		КонецЕсли;
	 КонецЦикла;

КонецПроцедуры

#КонецОбласти 


&НаКлиенте
Процедура ОбновитьТЧ(Команда)
	
	Для каждого СтрокаТЧ Из Объект.Инвойсы Цикл
		УстановитьКоличествоПоставки(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшДанных()
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Инвойсы", Объект.Инвойсы.Выгрузить().ВыгрузитьКолонку("Инвойс"));
	Запр.Текст = "ВЫБРАТЬ
	             |	МАКСИМУМ(_ИнвойсПоставки.Поставка) КАК Поставка,
	             |	_ИнвойсПоставки.Ссылка КАК Инвойс
	             |ИЗ
	             |	Документ._Инвойс.Поставки КАК _ИнвойсПоставки
	             |ГДЕ
	             |	_ИнвойсПоставки.Ссылка В(&Инвойсы)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	_ИнвойсПоставки.Ссылка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	_Инвойс.Ссылка КАК Инвойс,
	             |	ЕСТЬNULL(_ИнвойсПоставки.Поставка, 0) КАК Поставка,
	             |	ВЫБОР
	             |		КОГДА _ИнвойсПоставки.Поставка ЕСТЬ NULL
	             |			ТОГДА СкоррИнвойсы.КоличествоОборот
	             |		ИНАЧЕ СУММА(_ИнвойсПоставки.Количество)
	             |	КОНЕЦ КАК Количество,
	             |	ЕСТЬNULL(ВЫБОР
	             |		КОГДА _ИнвойсПоставки.Поставка ЕСТЬ NULL
	             |			ТОГДА СкоррИнвойсы.СуммаОборот
	             |		ИНАЧЕ СУММА(_ИнвойсПоставки.Сумма)
	             |	КОНЕЦ, 0) КАК Сумма,
	             |	СостоянияИнвойсов.Статус
	             |ИЗ
	             |	Документ._Инвойс КАК _Инвойс
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ._Инвойс.Поставки КАК _ИнвойсПоставки
	             |		ПО (_ИнвойсПоставки.Ссылка = _Инвойс.Ссылка)
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			СкорИнв.Инвойс КАК Инвойс,
	             |			СкорИнв.КоличествоОборот КАК КоличествоОборот,
	             |			СкорИнв.СуммаОборот КАК СуммаОборот
	             |		ИЗ
	             |			РегистрНакопления.СкорректированныеИнвойсы.Обороты(, , , Инвойс В (&Инвойсы)) КАК СкорИнв) КАК СкоррИнвойсы
	             |		ПО _Инвойс.Ссылка = СкоррИнвойсы.Инвойс
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
	             |		ПО СостоянияИнвойсов.Инвойс = _Инвойс.Ссылка
	             |ГДЕ
	             |	_Инвойс.Ссылка В(&Инвойсы)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	_ИнвойсПоставки.Поставка,
	             |	_Инвойс.Ссылка,
	             |	СкоррИнвойсы.КоличествоОборот,
	             |	СкоррИнвойсы.СуммаОборот,
	             |	СостоянияИнвойсов.Статус";
	РезультатЗапроса = Запр.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Соотв = Новый Соответствие; 
	Пока Выборка.Следующий() Цикл
		Соотв.Вставить(Выборка.Инвойс, Новый Структура("КоличествоПоставокВИнвойсе, ПоставкиИнвойсов", Выборка.Поставка, Новый Соответствие));
	КонецЦикла;    
	
	//Объект.Сумма = 0;
	ВыборкаП = РезультатЗапроса[1].Выбрать();
	Пока ВыборкаП.Следующий() Цикл
		НайдСоотв = Соотв[ВыборкаП.Инвойс]; 
		Если НайдСоотв = Неопределено Тогда
			Соотв.Вставить(ВыборкаП.Инвойс, Новый Структура("КоличествоПоставокВИнвойсе, ПоставкиИнвойсов", 0, Новый Соответствие));
			НайдСоотв = Соотв[ВыборкаП.Инвойс]; 
		КонецЕсли;
		НайдСоотв.ПоставкиИнвойсов.Вставить(ВыборкаП.Поставка, Новый Структура("Количество,Сумма,Статус", ВыборкаП.Количество, ВыборкаП.Сумма, ВыборкаП.Статус));
		//+
		НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс, Поставка", ВыборкаП.Инвойс, ВыборкаП.Поставка));
		Если НайдСтроки.Количество() > 0 Тогда
			//	НайдСтроки[0].РасхождениеСумма 		= НайдСтроки[0].Сумма <> ВыборкаП.Сумма;
			//	НайдСтроки[0].РасхождениеКоличество = НайдСтроки[0].Количество <> ВыборкаП.Количество;   
			НайдСтроки[0].Количество 	= ВыборкаП.Количество;
			НайдСтроки[0].Сумма 		= ВыборкаП.Сумма; 
			НайдСтроки[0].Статус		= ВыборкаП.Статус;
		//	Объект.Сумма = Объект.Сумма + ВыборкаП.Сумма; 
		КонецЕсли;
		//-
	КонецЦикла;     
	
	КэшДанных = Новый Структура("Инвойсы", Соотв); 
	////КэшДанных.Вставить("ПоказателиИнвойсов", ПоказателиИнвойсов());
	КэшДанных.Вставить("РаскрашиватьВалюты", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
 	КэшДанных.Вставить("ЦветаВалют", ОбщегоНазначенияПовтИсп.ЦветаВалют());
	КэшДанных.Вставить("СписокРаспределенныхЗатрат", СписокРаспределенныхЗатрат());

КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличествоПоставки(ТекДанные)
	
	ДанныеПоставки = КэшДанных.Инвойсы[ТекДанные.Инвойс].ПоставкиИнвойсов[ТекДанные.Поставка]; 
	Если ДанныеПоставки <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеПоставки, "Количество,Сумма,Статус"); 
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьДанныеСтрокиПоИнвойсу(СтрокаТЧ)
	
	ЗаполнитьКэшДанных();
	УстановитьКоличествоПоставки(СтрокаТЧ); 
	ОбновитьИтоги();
   	Модифицированность = Истина;
   
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()

	Элементы.ИнвойсыКоличество.ТекстПодвала = Объект.Инвойсы.Итог("Количество");
	Элементы.ИнвойсыСумма.ТекстПодвала = Объект.Инвойсы.Итог("Сумма");
    
КонецПроцедуры


&НаСервере
Функция СписокРаспределенныхЗатрат()
	
	тз =  Объект.РаспределениеЗатрат.Выгрузить(,"ТоварнаяГруппа");
	тз.Свернуть("ТоварнаяГруппа");
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения( тз.ВыгрузитьКолонку("ТоварнаяГруппа") );   
	Список.Добавить(Справочники.ГруппыПодбораНоменклатуры.ПустаяСсылка());
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура ПодборИнвойсов(Команда)
	
	ОткрытьФорму("Документ._Инвойс.Форма.ФормаВыбораДоставки", 
		Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, МножественныйВыбор, ВыбранныеИнвойсы, ВидимостьКнопкиВыбора, ИспользоватьСписокОтправок",
						Ложь, Истина, Ложь, ИнвойсыДокумента(), Ложь, Истина), 
		ЭтаФорма,
		, , ,
		Новый ОписаниеОповещения("ПриЗакрытииФормыПодбора", ЭтаФорма, "Подбор"), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);

КонецПроцедуры

&НаСервере
Функция ИнвойсыДокумента()
	
	Спис = Новый СписокЗначений;
	Для каждого СтрокаТЧ Из Объект.Инвойсы Цикл
		Спис.Добавить(СтрШаблон("%1#%2", СтрокаТЧ.Инвойс.Номер, Формат(СтрокаТЧ.Поставка,"")));
	КонецЦикла;
	Возврат Спис;

КонецФункции 



#Область РаботаСФайлами

&НаКлиенте
Процедура НажатиеГиперссылкиФайла(Элемент, СтандартнаяОбработка) 
	
	ПараметрыФормы = Новый Структура("ВладелецСсылка, НазначениеФайла, ИмяАктивнойГиперссылки, ДобавлениеФайла", 
									Объект.Ссылка, 
									ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"),
									?(Элемент=Неопределено, "", Элемент.Имя),
									Элемент=Неопределено);
	ОткрытьФорму("Обработка.Предпросмотр.Форма.ФормаПредпросмотра", ПараметрыФормы, ЭтаФорма,,,, );

КонецПроцедуры

&НаСервере
Процедура СформироватьГиперссылкиФайловНаФорме() 

	ОбщегоНазначенияСервер.СформироватьГиперссылкиФайловНаФорме(Объект.Ссылка, 
																ЭтаФорма, 
																Элементы.ГруппаФайлы, 
																ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"), 
																"НажатиеГиперссылкиФайла");

КонецПроцедуры
	
&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	СтандартнаяОбработка = Ложь;
	НажатиеГиперссылкиФайла(Неопределено, СтандартнаяОбработка) 

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайла(ЕстьВыборПользователя, Адрес, ВыбранноеИмяФайла, ДопПараметры) Экспорт 
	
	Если ЕстьВыборПользователя = Ложь Тогда
        Возврат;
    КонецЕсли;
	
	//Сообщить("Тип клиента: "+ПолучитьТипКлиента());
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбработкаВыбораФайлаПрикрепить(Адрес, ВыбранноеИмяФайла, ДопПараметры);
		Возврат;
	КонецЕсли;
	
	клДаНет(Новый ОписаниеОповещения("ОбработкаВыбораФайлаПослеЗаписи", ЭтотОбъект, 
			Новый Структура("Адрес, ВыбранноеИмяФайла, ДопПараметры", Адрес, ВыбранноеИмяФайла, ДопПараметры)),
		НСтр("ru = 'Документ еще не записан. Записать его и прикрепить файл?'; en = 'The document has not yet been saved. Save it and attach the file?'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаПослеЗаписи(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Записать();
	ОбработкаВыбораФайлаПрикрепить(Параметры.Адрес, Параметры.ВыбранноеИмяФайла, Параметры.ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаПрикрепить(Адрес, ВыбранноеИмяФайла, ДопПараметры)
	Если ОбщегоНазначенияСервер.ПолучитьТипКлиента() = "WebServerExtension" Тогда
		//в параметре "ВыбранноеИмяФайла" строка имени файла без полного пути, например: name.ext
		л_ОписаниеФайла = Новый Структура();
		л_ОписаниеФайла.Вставить("Имя", 				ВыбранноеИмяФайла);
		л_ОписаниеФайла.Вставить("ИмяБезРасширения", 	ОбщегоНазначения.ПолучитьИмяБезРасширения(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("ПолноеИмя", 			"");
		л_ОписаниеФайла.Вставить("Путь", 				"");
		л_ОписаниеФайла.Вставить("Расширение", 			ОбщегоНазначения.ПолучитьРасширение(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("Размер", 				ПолучитьИзВременногоХранилища(Адрес).Размер());
		л_ОписаниеФайла.Вставить("Назначение", 			ДопПараметры);
		//л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);

		л_Отказ			= Ложь;
		л_Сообщение		= "";
		л_КлючЗаписи	= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор");
		
		//ДобавитьВложенныйФайл(Адрес, ВладелецФормы.Объект.Ссылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		ОбщегоНазначенияСервер.ДобавитьВложенныйФайл(Адрес, Объект.Ссылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
		Если НЕ л_Отказ Тогда 
			ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
			//Оповестить("ОбновитьСтрокуПрикреплений", л_ОписаниеФайла.Имя, ЭтаФорма);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(л_Сообщение) Тогда
			Сообщить(л_Сообщение);
		КонецЕсли;
		
	Иначе 		
		
		л_Файл = Новый Файл(ВыбранноеИмяФайла);
		л_ОписаниеФайла = Новый Структура("Имя,ИмяБезРасширения,ПолноеИмя,Путь,Расширение");
		ЗаполнитьЗначенияСвойств(л_ОписаниеФайла, л_Файл);
		л_ОписаниеФайла.Вставить("Размер",					0);
		л_ОписаниеФайла.Вставить("Файл",					л_Файл);
		л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);
		л_ОписаниеФайла.Вставить("Назначение", 				ДопПараметры);
		
		л_Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ПослеПроверкиСуществованияФайла", ЭтаФорма, л_ОписаниеФайла));
		
	КонецЕсли;
	
КонецПроцедуры // ПослеПомещенияФайлаВоВременноеХранилище()

&НаКлиенте
Процедура ПослеПроверкиСуществованияФайла(ФайлСуществует, ПараметрыФайла) Экспорт 
	
	Если ФайлСуществует Тогда 
		ПараметрыФайла.Файл.НачатьПолучениеРазмера(Новый ОписаниеОповещения("ПослеПолученияРазмераФайла", ЭтаФорма, ПараметрыФайла));
	Иначе 
		клОшибка(СтрШаблон( НСтр("ru = 'Папка %1 не существует!'; en = 'Folder %1 does not exist!'"), ПараметрыФайла.Путь)); 
	КонецЕсли;  
	
КонецПроцедуры // ПослеПроверкиСуществованияФайла()

&НаКлиенте
Процедура ПослеПолученияРазмераФайла(Результат, Параметр) Экспорт
	
	Параметр.Размер = Результат;
	
	//удалить свойство структуры "Файл" т.к. оно вызывает ошибку преобразования данных XDTO: Отсутствует отображение для типа 'Файл'
	Параметр.Удалить("Файл");
	
	л_Отказ		= Ложь;
	л_Сообщение	= "";
	л_КлючЗаписи= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор,НазначениеФайла");
	
	ОбщегоНазначенияСервер.ДобавитьВложенныйФайл(Параметр.АдресВременногоХранилища, Объект.Ссылка, Параметр, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
	Если НЕ л_Отказ Тогда 
		ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
		//Оповестить("ОбновитьСтрокуПрикреплений", Параметр.Имя, ЭтаФорма);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(л_Сообщение) Тогда
		Сообщить(л_Сообщение);
	КонецЕсли;   
	
КонецПроцедуры // ПолучитьРазмерФайла()

#КонецОбласти


#Область ПодключаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(Объект.Ссылка, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы.ОтправкаAWB.ПечатьДокумента(Объект.Ссылка, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти


#Область Дерево

&НаСервере
Процедура ЗаполнитьДеревоЗначенийНаСервере()
	
	Дер = РеквизитФормыВЗначение("Дерево");
	Дер.Строки.Очистить();
	ИтКоличество = 0;
	ИтСумма = 0;
	ИтВес = 0;
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ТЗ.Номенклатура КАК Номенклатура,
	             |	ТЗ.Затрата КАК Затрата,
	             |	ТЗ.Количество КАК Количество,
	             |	ТЗ.Цена КАК Цена,
	             |	ТЗ.Вес КАК Вес,
	             |	ТЗ.Сумма КАК Сумма
	             |ПОМЕСТИТЬ ТЗ
	             |ИЗ
	             |	&ТЧ КАК ТЗ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ОтправкаРаспределениеЗатрат.Номенклатура КАК Номенклатура,
	             |	ОтправкаРаспределениеЗатрат.Затрата КАК Затрата,
	             |	ОтправкаРаспределениеЗатрат.Количество КАК Количество,
	             |	ОтправкаРаспределениеЗатрат.Цена КАК Цена,
	             |	ОтправкаРаспределениеЗатрат.Вес КАК Вес,
	             |	ОтправкаРаспределениеЗатрат.Сумма КАК Сумма
	             |ИЗ
	             |	ТЗ КАК ОтправкаРаспределениеЗатрат
	             |ИТОГИ
	             |	СРЕДНЕЕ(Количество),
	             |	СРЕДНЕЕ(Цена),
	             |	СРЕДНЕЕ(Вес),
	             |	СУММА(Сумма)
	             |ПО
	             |	Номенклатура,
	             |	Затрата";
	Запр.УстановитьПараметр("ТЧ", Объект.РаспределениеЗатрат.Выгрузить());
  	ВыборкаН = Запр.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаН.Следующий() Цикл
		СтрокаН = Дер.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаН, ВыборкаН);
		ВыборкаЗ = ВыборкаН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗ.Следующий() Цикл
			СтрокаЗ = СтрокаН.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗ, ВыборкаЗ, "Номенклатура,Затрата,Сумма");  
		КонецЦикла;
		ИтКоличество = ИтКоличество + ВыборкаН.Количество;
		ИтСумма = ИтСумма + ВыборкаН.Сумма; 
		ИтВес = ИтВес + ВыборкаН.Вес;
	КонецЦикла;
	ЗначениеВРеквизитФормы(Дер,"Дерево");
	
	Элементы.ДеревоКоличество.ТекстПодвала = ИтКоличество;
	Элементы.ДеревоСумма.ТекстПодвала = Формат(ИтСумма, "ЧДЦ=4");
	Элементы.ДеревоВес.ТекстПодвала = Формат(ИтВес, "ЧДЦ=3");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередУдалением(Элемент, Отказ)
	Отказ = истина
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти
